app/controllers/events_controller.rb

SELECT "lines".* FROM "lines" WHERE ("lines".event_id IN (1,2,3,4,5,6,7,8,37,9,10,11,12,13,14,15,16,17,18,38,19,20,21,22,23,24,39,40,41,25,26,27,28,29,30,31,42,32,33,34,43,35,36))
SELECT * FROM "events" ORDER BY event_date DESC, event_time DESC LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "events"
---
    Event
    Line
    @events = Rails.cache.fetch(params.to_s.gsub(/[^A-Za-z0-9]+/,''), :expires_in => 2.minutes) {
      Event.paginate(
        :page => params[:page],
        :include => [ :lines, :location ],
        :conditions => { "locations.status" => ["VALID","APPROXIMATE"],
                         "locations.latitude" => lat_min..lat_max,
                         "locations.longitude" => lon_min..lon_max,
                         "lines.call_received" => @time_min.getutc..@time_max.getutc},
        :order => "event_datetime DESC",
        :per_page => per_page
      )

SELECT * FROM "events" WHERE ("events"."id" = 1)
SELECT * FROM "lines" WHERE ("lines"."event_id" = 1)
---
  def show
    @event = Event.find(params[:id], :include => [:lines, :location])