app/controllers/lines_controller.rb

  def index
    @lines = Line.paginate(:page => params[:page], :order => "line_date DESC, call_received DESC")
---
SELECT * FROM "lines" ORDER BY line_date DESC, call_received DESC LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "lines"

  def show
    @line = Line.find(params[:id])
---
SELECT * FROM "lines" WHERE ("lines"."id" = 14)

  def create
    @line = Line.create(params[:Line])
    if (! @line.nil?)
      # We successfully created the line, so look for other lines that might
      # be part of the same event.  An event is a group of lines, which occur
      # at the same location, with no incident more than 15 minutes before or
      # after another incident in the same event.
      # TODO: This won't catch events that occur across date boundaries

      @window_begin = @line.call_received - 15.minutes
      @window_end = @line.call_received + 15.minutes

      @event = Event.find(:first,
        :conditions => { :event_date => @line.line_date,
                         :event_time => @window_begin..@window_end,
                         :location => @line.location })

      if (@event.nil?)
        logger.info("No existing event line - creating new Event")
        @event = Event.create(
            :event_date => @line.line_date,
            :event_time => @line.call_received,
            :location => @line.location,
            :tax_map => @line.tax_map
          )
        logger.info("New event id = #{@event.id}")
      else
        logger.info("Found existing event, event id = #{@event.id}")
      end
      @line.event_id = @event.id
      @line.save!
---
INSERT INTO "lines" ("incident_number", "event_id", "tax_map", "updated_at", "call_received", "line_date", "unit", "arrived_hosp", "url", "line_type", "staged_near_scene", "arrived_on_scene", "call_type", "call_dispatch", "unit_enroute", "left_scene", "in_service", "location", "created_at") VALUES(9360, NULL, '061', '2009-08-05 01:24:20', '2000-01-01 20:43:59', '2009-08-04', '140', '2000-01-01 00:00:00', 'calldisp.php?full_incidentno=MRS090804009360&unitno=140', 'rids', '2000-01-01 00:00:00', '2000-01-01 20:49:18', 'MOTOR VEHICLE ACCIDE', '2000-01-01 20:44:25', '2000-01-01 20:45:17', '2000-01-01 00:00:00', '2000-01-01 21:09:57', '2200 BARRACKS RD', '2009-08-05 01:24:20')
SELECT * FROM "events" WHERE ("events"."event_date" = '2009-08-05' AND "events"."event_time" BETWEEN '2000-01-01 20:13:57' AND '2000-01-01 20:43:57' AND "events"."location" = '1320 BRANCHLANDS DR') LIMIT 1
SELECT * FROM "lines" WHERE ("lines"."call_received" BETWEEN '2000-01-01 20:28:59' AND '2000-01-01 20:58:59' AND "lines"."line_date" = '2009-08-04' AND "lines"."location" = '2200 BARRACKS RD') LIMIT 1
INSERT INTO "events" ("tax_map", "latitude", "event_time", "event_date", "longitude", "location") VALUES('061', NULL, '2000-01-01 20:43:59', '2009-08-04', NULL, '2200 BARRACKS RD')
UPDATE "lines" SET "event_id" = 1, "updated_at" = '2009-08-05 02:07:00' WHERE "id" = 1